Catalogs/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПодакцизногоТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодакцизныхТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодакцизныйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучаемОтПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаПродажу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВПроизводство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственныеНужды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВЭксплуатациюСотрудникам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комплектуем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыНоменклатуры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ВидПодакцизногоТовара.Видимость = Объект.ПодакцизныйТовар;
	Элементы.ВидПодакцизногоТовара.Доступность = Не Объект.Услуга;
	
	Элементы.ВПроизводство.Видимость = Не Объект.Услуга;
	Элементы.ВЭксплуатациюСотрудникам.Видимость = Не Объект.Услуга;
	Элементы.Комплектуем.Видимость = Не Объект.Услуга;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_ВидНоменклатуры", Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	
	Если Объект.ПодакцизныйТовар Тогда
		Объект.Услуга = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Подакцизный товар не может быть услугой", , "Услуга", "Объект");
	КонецЕсли;
	Элементы.ВидПодакцизногоТовара.Доступность = Не Объект.Услуга;
	
	Элементы.ВПроизводство.Видимость = Не Объект.Услуга;
	Элементы.ВЭксплуатациюСотрудникам.Видимость = Не Объект.Услуга;
	Элементы.Комплектуем.Видимость = Не Объект.Услуга;
	
	Если Объект.Услуга Тогда
		Объект.ВЭксплуатациюСотрудникам = Ложь;
		Объект.ВПроизводство = Ложь;
		Объект.Комплектуем = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодакцизныйТоварПриИзменении(Элемент)
	
	Если Объект.Услуга Тогда
		Объект.ПодакцизныйТовар = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Услуга не может быть подакцизным товаром", , "ПодакцизныйТовар", "Объект");
	КонецЕсли;
	Элементы.ВидПодакцизногоТовара.Видимость = Объект.ПодакцизныйТовар;
	Элементы.ВидПодакцизногоТовара.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Объект.ВидПодакцизногоТовара) И Объект.ПодакцизныйТовар;

КонецПроцедуры

&НаКлиенте
Процедура ВидПодакцизногоТовараПриИзменении(Элемент)
	Элементы.ВидПодакцизногоТовара.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Объект.ВидПодакцизногоТовара);
КонецПроцедуры

#КонецОбласти
